[
  {
    "id": "riesling",
    "grapeName": "Riesling",
    "textInfoGrape": "Ela enfrenta enorme dificuldade para se adaptar fora de suas regiões de origem (principalmente Alemanha e Alsácia). Sua sensibilidade ao tipo de solo e clima é muito alta, não se adaptando a ficar com outras uvas. Além disso, ela não se beneficia do envelhecimento em madeira, o que dificulta ainda mais seu cultivo e vinificação em outras regiões.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/7/76/Riesling_grapes_leaves.jpg"
  },
  {
    "id": "pinot_noir",
    "grapeName": "Pinot Noir",
    "textInfoGrape": "Para seu cultivo, é necessário solo e clima em perfeita sintonia, leveduras nativas e o cuidadoso uso do amadurecimento em madeira, são eles requisitos mínimos para o sucesso dessa exigente uva. Contudo, com todos os requisitos, a recompensa é extremamente compensadora, resultando em vinhos elegantes e de complexidade singurares.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Grape_near_Sancerre.jpg"
  },
  {
    "id": "cabernet_sauvignon",
    "grapeName": "Cabernet Sauvignon",
    "textInfoGrape": "Considerada a rainha das uvas tintas, é conhecida por sua casca grossa, resultando em vinhos com taninos firmes e grande potencial de envelhecimento. Adapta-se bem a diferentes climas, mas brilha em solos bem drenados, como os de Bordeaux, onde expressa notas de cassis, cedro e especiarias.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Cabernet_Sauvignon_Gaillac.jpg"
  },
  {
    "id": "merlot",
    "grapeName": "Merlot",
    "textInfoGrape": "Mais macia e com maturação mais rápida que a Cabernet Sauvignon, a Merlot produz vinhos aveludados e fáceis de beber. Seus aromas remetem a frutas vermelhas e negras, como ameixa e amora. É sensível a geadas tardias, o que pode comprometer sua produção em climas mais frios.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Merlot_Grape.jpg"
  },
  {
    "id": "chardonnay",
    "grapeName": "Chardonnay",
    "textInfoGrape": "É uma das uvas brancas mais versáteis do mundo, capaz de produzir desde vinhos leves e frescos até exemplares encorpados e amanteigados, dependendo do terroir e do uso de carvalho. Sua maleabilidade a torna uma tela em branco para o enólogo, refletindo fielmente as condições de seu cultivo.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Chardonnay_Moldova.JPG"
  },
  {
    "id": "sauvignon_blanc",
    "grapeName": "Sauvignon Blanc",
    "textInfoGrape": "Famosa por sua acidez vibrante e aromas penetrantes de notas herbáceas, aspargos e frutas cítricas como maracujá e limão. Prefere climas mais frios para desenvolver sua intensidade aromática característica. É uma uva de maturação precoce, o que exige atenção na colheita para não perder sua acidez.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Sauvignon_blanc_vlasotince_vineyards.jpg"
  },
  {
    "id": "syrah",
    "grapeName": "Syrah",
    "textInfoGrape": "Também conhecida como Shiraz, esta uva prospera em climas quentes e ensolarados, desenvolvendo sabores de frutas negras, azeitona e um toque picante de pimenta preta. Seus vinhos são geralmente encorpados e com taninos robustos. O controle do vigor da videira é crucial para garantir a qualidade.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Shiraz_Grapes.jpg"
  },
  {
    "id": "malbec",
    "grapeName": "Malbec",
    "textInfoGrape": "Embora de origem francesa, encontrou sua melhor expressão na Argentina. A altitude e o clima seco de Mendoza permitem que ela amadureça plenamente, criando vinhos com cor profunda, taninos doces e notas de ameixa e violeta. É sensível a geadas e doenças fúngicas em climas mais úmidos.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Malbec_grapes.jpg"
  },
  {
    "id": "zinfandel",
    "grapeName": "Zinfandel",
    "textInfoGrape": "Conhecida por sua maturação desigual, onde um mesmo cacho pode ter uvas passas e uvas ainda verdes, exigindo uma colheita cuidadosa. Gera vinhos potentes, com alto teor alcoólico e sabores de geleia de frutas vermelhas. É geneticamente idêntica à Primitivo da Itália e à Crljenak Kaštelanski da Croácia.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Zinfandel_Cluster_and_Roses.jpg"
  },
  {
    "id": "nebbiolo",
    "grapeName": "Nebbiolo",
    "textInfoGrape": "Nativa do Piemonte, Itália, é uma uva de maturação tardia e muito exigente com o local de plantio. Seu nome deriva de 'nebbia' (névoa), comum na região durante a colheita. Produz vinhos estruturados, tânicos e com enorme potencial de guarda, revelando aromas complexos de rosas, alcatrão e cereja.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/9/91/Close_up_of_Nebbiolo_cluster_in_Italy.jpg"
  },
  {
    "id": "sangiovese",
    "grapeName": "Sangiovese",
    "textInfoGrape": "A alma da Toscana e a base de vinhos como o Chianti e o Brunello di Montalcino. Possui alta acidez e taninos firmes, com aromas de cereja ácida, tomate e ervas. Sua qualidade é altamente dependente do clone e do terroir, mostrando grande variação de estilo conforme a região de cultivo.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Sangiovese_grapes_for_chianti.jpg"
  },
  {
    "id": "tempranillo",
    "grapeName": "Tempranillo",
    "textInfoGrape": "Principal uva da Espanha, seu nome significa 'cedo', referindo-se à sua maturação precoce. Adapta-se bem a diferentes solos e climas, mas prefere dias quentes e noites frias para equilibrar açúcar e acidez. Gera vinhos com notas de frutas vermelhas, couro, tabaco e baunilha, especialmente com envelhecimento em carvalho.",
    "url": "https://www.wine.com.br/winepedia/wp-content/uploads/2018/01/Tempranillo-1180x517.jpg"
  },
  {
    "id": "gamay",
    "grapeName": "Gamay",
    "textInfoGrape": "Famosa por ser a estrela dos vinhos Beaujolais, na França. É uma uva de alta produtividade que prefere solos graníticos para mostrar seu melhor potencial. Produz vinhos leves, com poucos taninos, alta acidez e aromas frescos de banana, morango e framboesa, ideais para consumo jovem.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/3/38/Gamay.jpg"
  },
  {
    "id": "grenache",
    "grapeName": "Grenache",
    "textInfoGrape": "Também conhecida como Garnacha, é uma uva que tolera muito bem o calor e a seca, sendo amplamente plantada no sul da França e na Espanha. Produz vinhos com alto teor alcoólico, corpo médio e sabores de frutas vermelhas maduras, como morango, e notas de especiarias. É fundamental em blends como o Châteauneuf-du-Pape.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Grenache_noir_grapes.jpg"
  },
  {
    "id": "viognier",
    "grapeName": "Viognier",
    "textInfoGrape": "Uva branca aromática, famosa no norte do Rhône. É de cultivo difícil, com rendimentos naturalmente baixos e suscetível a doenças. Quando bem vinificada, produz vinhos encorpados e perfumados, com notas de damasco, pêssego e flores como violeta e madressilva. A colheita no ponto certo é crucial.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/7/78/Viognier.jpg"
  },
  {
    "id": "gewurztraminer",
    "grapeName": "Gewürztraminer",
    "textInfoGrape": "Extremamente aromática, esta uva é inconfundível no nariz, com intensos aromas de lichia, pétalas de rosa e gengibre. Sua casca rosada resulta em vinhos brancos com uma cor dourada profunda. É uma casta de baixa acidez, que prospera em climas frios como o da Alsácia para manter seu equilíbrio.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Gew%C3%BCrztraminer.jpg"
  },
  {
    "id": "moscato",
    "grapeName": "Moscato",
    "textInfoGrape": "Uma família de uvas com mais de 200 variedades, famosa por seus vinhos doces, frisantes e muito aromáticos, com notas de flor de laranjeira, pêssego e uva fresca. A Moscato Bianco é a mais nobre, utilizada para o Moscato d'Asti. É cultivada em todo o mundo, sendo uma das uvas mais antigas conhecidas.",
    "url": "https://www.embrapa.br/bme_images/thumb/58560040thumb.jpg"
  },
  {
    "id": "montepulciano",
    "grapeName": "Montepulciano",
    "textInfoGrape": "Esta é a segunda uva tinta mais plantada na Itália, predominante na região de Abruzzo. Não deve ser confundida com o Vino Nobile di Montepulciano (que é feito de Sangiovese). Produz vinhos com cor escura, taninos suaves e sabores de amora e ameixa, com um final levemente amargo.",
    "url": "https://enologuia.com.br/wp-content/uploads/2018/08/Montepulciano_Reduzida.jpg"
  },
  {
    "id": "petit_verdot",
    "grapeName": "Petit Verdot",
    "textInfoGrape": "Uma das seis uvas permitidas no corte bordalês, é usada em pequenas proporções para adicionar cor, taninos e estrutura. Sua maturação é muito tardia, o que a torna difícil de cultivar em Bordeaux, mas prospera em climas mais quentes. Possui notas de violeta, mirtilo e um toque de sálvia.",
    "url": "https://www.bordeaux.com/wp-content/uploads/2018/01/Petit-Verdot-8.jpg"
  },
  {
    "id": "cabernet_franc",
    "grapeName": "Cabernet Franc",
    "textInfoGrape": "Parente da Cabernet Sauvignon, a Cabernet Franc é mais leve em corpo e taninos, com uma maturação mais precoce. É famosa por seus aromas distintos de pimentão, framboesa e folha de tabaco. No Vale do Loire, onde é a principal uva tinta, produz vinhos vibrantes e elegantes.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/6/63/Cab_Franc_grape.JPG"
  },
  {
    "id": "glera",
    "grapeName": "Glera",
    "textInfoGrape": "Uva branca anteriormente conhecida como Prosecco, é a alma do famoso espumante italiano. É uma variedade de alta produtividade, cultivada principalmente no Vêneto. Seus vinhos são leves e refrescantes, com aromas delicados de maçã verde, pera, flores brancas e um toque cítrico.",
    "url": "https://www.divvino.com.br/blog/wp-content/uploads/2021/01/uva-glera-glera-ou-prosecco.jpg"
  },
  {
    "id": "touriga_nacional",
    "grapeName": "Touriga Nacional",
    "textInfoGrape": "Considerada a uva mais nobre de Portugal, é a espinha dorsal de muitos Vinhos do Porto e tintos do Douro e Dão. Possui casca grossa, taninos intensos e aromas concentrados de frutas negras, violeta e bergamota. É uma uva de baixo rendimento, mas de altíssima qualidade.",
    "url": "https://enologuia.com.br/wp-content/uploads/2018/07/Touriga_Nacional_Reduzida_450.jpg"
  },
  {
    "id": "concord",
    "grapeName": "Concord",
    "textInfoGrape": "Arquétipo da uva americana, famosa pelo seu uso em sucos e geleias. Possui um aroma intenso e inconfundível conhecido como 'foxado', resultante do composto antranilato de metila. Seus vinhos de mesa são simples, doces e com sabor que remete a 'suco de uva de caixinha'.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/d/df/ConcordGrapes.jpg"
  },
  {
    "id": "niagara_rosada",
    "grapeName": "Niagara Rosada",
    "textInfoGrape": "Uma mutação somática da Niagara Branca, esta variedade se diferencia pela coloração rosada de sua casca. Mantém o perfil aromático 'foxado' intenso e a doçura de sua versão branca, sendo muito apreciada para o consumo de mesa e produção de sucos rosados e vinhos de mesa suaves.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/d/da/Uva_Niagara.JPG"
  },
  {
    "id": "isabel",
    "grapeName": "Isabel",
    "textInfoGrape": "Uma das uvas mais cultivadas no Brasil, especialmente no Sul, é a base para a maioria dos sucos de uva integrais e vinhos de mesa coloniais. É uma uva rústica, de alta produtividade, que gera vinhos com aromas primários muito diretos e o característico perfil 'foxado'.",
    "url": "https://mudasherculandia.com.br/wp-content/uploads/2023/03/Uva-Isabel.jpg"
  },
  {
    "id": "bordo",
    "grapeName": "Bordô",
    "textInfoGrape": "Famosa por sua capacidade de gerar sucos e vinhos de uma cor violeta extremamente profunda e opaca. Seu aroma 'foxado' é um dos mais potentes entre as uvas labruscas, sendo apreciada por sua intensidade. É frequentemente usada para dar cor a outros vinhos e sucos.",
    "url": "https://imagens.ne10.uol.com.br/veiculos/_midias/jpg/2022/10/14/806x444/1_uv-21885396.jpg?20240417084713"
  }
]